#include<stdio.h>
#include<stdlib.h>

int main(){
    int member = 0;//สร้างตัวแปรรับค่าจำนวนโดยเมื่อยังไม่ได้รับค่ามาเก็บจึงเซ็ตค่าเริ่มต้นไว้ที่0
    scanf("%d",&member);//รับค่าจำนวนตัวเลขจากผู้ใช้เพื่อมาใช้ในการจองเมมโมรี่
    int *arr = (int*)calloc(member,sizeof(int));//สร้างตัวแปรarrayในการเก็บตัวเลขชุดแรกและเรียกใช้ฟังก์ชันcallocในการจองพื้นที่ตามจำนวนข้อมูลจากค่าmember
    int *arrSort = (int*)calloc(member,sizeof(int));//สร้างตัวแปรarrayขนาดเท่าarrayตัวแรกเพื่อใช้ในการเก็บข้อมูลจากอีกarrayมาจัดเรียงโดยที่อีกarrayยังคงตำแหน่งที่เดิม
    int maxSec = 0, minSec = 0;//สร้างตัวแปรเก็บค่าจำนวนที่มากสุดเป็นอันดับสองไว้ในmaxSecและเก็บจำนวนที่น้อยสุดอันดับสองไว้ในminSec

    for(int i = 0; i < member; i++){
        scanf("%d", arr+i);//วนลูปรับค่าจากผู้ใช้มาเก็บไว้ในarray-arr
        *(arrSort+i) = *(arr+i);//นำค่าที่เพิ่งรับในarray-arrมาเก็บในarrayarrSort
    }

    for(int i = 0; i < member;i++){
        for(int j  = 0; j < member-1; j++){
            if(*(arrSort+j+1) < *(arrSort+j)){//วนลูปเข้าเงื่อนไขเพื่อจัดเรียงข้อมูลในarrSortให้เรียงจากข้อมูลค่าน้อยไปมาก โดยการเช็คค่าหน้ามากกว่าค่าหลังมั้ย
                int temp = *(arrSort+j+1);//เมื่อเข้าเงื่อนไขสร้างตัวแปรเพื่อมารับค่าข้อมูลตัวที่มีค่าน้อยกว่าเพื่อที่จะให้ข้อมูลไม่หายไปเมื่อต้องการสลับที่ข้อมูลในบรรทัดล่าง
                *(arrSort+j+1) = *(arrSort+j);//ทำการนำข้อมูลตัวที่มีค่ามากกว่ามาเก็บในตัวที่อยู่ข้างหลัง หรือตัวที่มีค่าน้อยกว่าเพื่อสลับที่กัน
                *(arrSort+j) = temp;//นำค่าข้อมูลตัวที่น้อยกว่าที่เคยเก็บไว้ในtempมาใส่ในตัวหน้า หรือตัวที่มีค่ามากกว่าเพื่อสลับที่กัน
            }
        }
    }
    maxSec = *(arrSort+member-2);//เมื่อจัดเรียงข้อมูลจากน้อยไปมากแล้วข้อมูลตัวที่มากสุดอับดับสอง หรือตัวที่อยู่ก่อนตัวสุดท้ายจะถูกนำมาเก็บในตัวแปรmaxSec
    minSec = *(arrSort+1);//นำค่าข้อมูลตัวที่น้อยสุดเป็นอันดับสอง หรือตัวที่สองเนื่องจากจัดเรียงข้อมูลแล้วมาเก็บไว้ในตัวแปรminSec

    for(int i = 0; i < member; i++){//วนลูปตามจำนวนข้อมูล
        if(*(arr+i) == minSec)//เข้าเงื่อนไขเพื่อหาข้อมูลในarrที่ตรงกับข้อมูลตัวที่น้อยที่สุดอันดับสองในminSec
            *(arr+i) = maxSec;//เมื่อเงื่อนไขเป็นจริงนำค่าข้อมูลตัวที่มากสุดอันดับสองในmaxSecมาเก็บแทนที่ข้อมูลตัวนั้นที่ตรงกับค่าน้อยสุดอันดับสอง เป็นการสลับที่ค่าน้อยสุดอันดับสองกับค่ามากสุดอันดับสอง
        else if(*(arr+i) == maxSec)//เข้าเงื่อนไขเพื่อหาข้อมูลในarrที่ตรงกับข้อมูลตัวที่มากที่สุดอันดับสองในmaxSec
            *(arr+i) = minSec;//เมื่อเงื่อนไขเป็นจริงนำค่าข้อมูลตัวที่น้อยสุดอันดับสองในminSecมาเก็บแทนที่ข้อมูลตัวนั้นที่ตรงกับค่ามากสุดอันดับสอง เป็นการสลับที่ค่ามากสุดอันดับสองกับค่าน้อยสุดอันดับสอง
    }
    for(int i = 0; i < member; i++){
        printf("%d ",*(arr+i));//วนลูปแสดงค่าในarray-arrที่ทำการสลับที่ระหว่างตัวน้อยสุดอันดับสองกับตัวมากสุดอันดับสองแล้ว
    }

    free(arr);//ทำการคืนเมมโมรี่ที่จองไว้ในarrเมื่อจบการทำงาน
    free(arrSort);//ทำการคืนเมมโมรี่ที่จองไว้ในarrSortเมื่อจบการทำงาน
    return 0;
}